package lesson20;

public class Main {

    public static void main(String[] args) {
        //TODO
        // Имея бесконечный набор случайных интов
        // Реализуйте метод put, чтобы он сохранял эти значения в некоторой структуре
        // И метод top, возвращающий 5 наибольших значений из тех, которые были получены к текущему моменту
        // Без повторений
    }

    // Сохраняет переданное значение
    static void put(int a) {

    }

    // Выводит 5 наибольших значений
    static int[] top() {

        return new int[0];
    }
}
