package lesson22;

public class Classwork {

    public static void main(String[] args) {
        //TODO:
        // 1. Написать метод, который получает на вход список
        // 2. Для каждого вызова первого метода, полученную коллекцию нужно разбить по элементам и каждый элемент
        // передать во второй метод, который так же будет типизирован типом коллекции
        // Второй метод должен проверять, является ли число простым, а первый метод должен возвращать количество
        // простых чисел в коллекции
    }
}
